sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
#if RTC_SUPPORT
    _deepSleepParams.unixtime = getRTC();
#else
    time_t now = ::time(nullptr);
    if (IS_TIME_VALID(now)) {
        // _deepSleepParams.unixtime = now;
    }
#endif

    // WiFiCallbacks::getVector().clear(); // disable WiFi callbacks to speed up shutdown
    // Scheduler.terminate(); // halt scheduler

    resetDetector.clearCounter();
    SaveCrash::removeCrashCounter();

    delay(1);

    for(auto plugin: PluginComponents::Register::getPlugins()) {
        plugin->prepareDeepSleep(time.count());
    }
    if (delayAfterPrepare) {
        delay(delayAfterPrepare);
    }
    __LDBG_printf("Entering deep sleep for %u milliseconds, RF mode %d", time.count(), mode);

#if __LED_BUILTIN == NEOPIXEL_PIN_ID
    BUILDIN_LED_SET(BlinkLEDTimer::BlinkType::OFF);
#endif

    DeepSleep::DeepSleepParam::enterDeepSleep(time);
}

static void invoke_ESP_restart()
{
#if __LED_BUILTIN == NEOPIXEL_PIN_ID
    BlinkLEDTimer::setBlink(__LED_BUILTIN, BlinkLEDTimer::OFF);
#endif
    ESP.restart();
}

#if PIN_MONITOR
#include "pin_monitor.h"
#endif

void KFCFWConfiguration::restartDevice(bool safeMode)
{
    __LDBG_println();

// enable debugging output (::printf) for shutdown sequence
#define DEBUG_SHUTDOWN_SEQUENCE DEBUG

    String msg = F("Device is being restarted");
    if (safeMode) {
        msg += F(" in SAFE MODE");
    }
    Logger_notice(msg);
    BUILDIN_LED_SET(BlinkLEDTimer::BlinkType::FLICKER);

    delay(500);

    SaveCrash::removeCrashCounterAndSafeMode();
    resetDetector.setSafeMode(safeMode);
    if (_safeMode) {
#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("safe mode: invoking restart\n"));
#endif
        invoke_ESP_restart();
    }

    // clear queue silently
    ADCManager::terminate(false);

#if HTTP2SERIAL_SUPPORT
#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("terminating http2serial instance\n"));
#endif
    Http2Serial::destroyInstance();
#endif

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("scheduled tasks %u, WiFi callbacks %u, Loop Functions %u\n"), _Scheduler.size(), WiFiCallbacks::getVector().size(), LoopFunctions::size());
#endif

    auto webUiSocket = WebUISocket::getServerSocket();
    if (webUiSocket) {
#if DEBUG_SHUTDOWN_SEQUENCE
        ::printf(PSTR("terminating webui websocket=%p\n"), webUiSocket);
#endif
        webUiSocket->shutdown();
    }

    // execute in reverse order
    auto &plugins = PluginComponents::RegisterEx::getPlugins();
    for(auto iterator = plugins.rbegin(); iterator != plugins.rend(); ++iterator) {
        const auto plugin = *iterator;
#if DEBUG_SHUTDOWN_SEQUENCE
        ::printf(PSTR("shutdown plugin=%s\n"), plugin->getName_P());
#endif
        plugin->shutdown();
        plugin->clearSetupTime();
    }

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("scheduled tasks %u, WiFi callbacks %u, Loop Functions %u\n"), _Scheduler.size(), WiFiCallbacks::getVector().size(), LoopFunctions::size());
#endif

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("terminating pin monitor\n"));
#endif
#if PIN_MONITOR
    pinMonitor.end();
#endif

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("terminating serial handlers\n"));
#endif
    serialHandler.end();
#if DEBUG
    debugStreamWrapper.clear();
#endif

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("clearing wifi callbacks\n"));
#endif
    WiFiCallbacks::clear();

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("clearing loop functions\n"));
#endif
    LoopFunctions::clear();

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("terminating event scheduler\n"));
#endif
    __Scheduler.end();

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("invoking restart\n"));
#endif
    invoke_ESP_restart();
}

void KFCFWConfiguration::loop()
{
    rng.loop();
    config.gc();
}

uint8_t KFCFWConfiguration::getMaxWiFiChannels()
{
    wifi_country_t country;
    if (!wifi_get_country(&country)) {
        country.nchan = 255;
    }
    return country.nchan;
}

const __FlashStringHelper *KFCFWConfiguration::getWiFiEncryptionType(uint8_t type)
{
#if defined(ESP32)
    switch(type) {
        case WIFI_AUTH_OPEN:
            return F("open");
        case WIFI_AUTH_WEP:
            return F("WEP");
        case WIFI_AUTH_WPA_PSK:
            return F("WPA/PSK");
        case WIFI_AUTH_WPA2_PSK:
            return F("WPA2/PSK");
        case WIFI_AUTH_WPA_WPA2_PSK:
            return F("WPA/WPA2/PSK");
        case WIFI_AUTH_WPA2_ENTERPRISE:
            return F("WPA2/ENTERPRISE");
    }
#elif defined(ESP8266)
    switch(type) {
        case ENC_TYPE_NONE:
            return F("open");
        case ENC_TYPE_WEP:
            return F("WEP");
        case ENC_TYPE_TKIP:
            return F("WPA/PSK");
        case ENC_TYPE_CCMP:
            return F("WPA2/PSK");
        case ENC_TYPE_AUTO:
            return F("auto");
    }
#endif
    return F("N/A");
}

bool KFCFWConfiguration::reconfigureWiFi()
{
    WiFi.persistent(false); // disable during disconnects since it saves the configuration
    WiFi.setAutoConnect(false);
    WiFi.setAutoReconnect(false);
    WiFi.disconnect(true);
    WiFi.softAPdisconnect(true);
    WiFi.persistent(true);

    return connectWiFi();
}

bool KFCFWConfiguration::connectWiFi()
{
    __LDBG_println();
    setLastError(String());

    bool station_mode_success = false;
    bool ap_mode_success = false;

    auto flags = System::Flags::getConfig();
    if (flags.is_station_mode_enabled) {
        __LDBG_print("init station mode");
        WiFi.setAutoConnect(false); // WiFi callbacks have to be installed first during boot
        WiFi.setAutoReconnect(true);

        auto network = Network::Settings::getConfig();

        bool result;
        if (flags.is_station_mode_dhcp_enabled) {
            result = WiFi.config((uint32_t)0, (uint32_t)0, (uint32_t)0, (uint32_t)0, (uint32_t)0);
        } else {
            result = WiFi.config(network.getLocalIp(), network.getGateway(), network.getSubnet(), network.getDns1(), network.getDns2());
        }
        if (!result) {
            PrintString message;
            message.printf_P(PSTR("Failed to configure Station Mode with %s"), flags.is_station_mode_dhcp_enabled ? PSTR("DHCP") : PSTR("static address"));
            setLastError(message);
            Logger_error(message);
        } else {

            if (WiFi.begin(Network::WiFi::getSSID(), Network::WiFi::getPassword()) == WL_CONNECT_FAILED) {
                String message = F("Failed to start Station Mode");
                setLastError(message);
                Logger_error(message);
            } else {
                __LDBG_printf("Station Mode SSID %s", Network::WiFi::getSSID());
                station_mode_success = true;
            }
        }
    }
    else {
        __LDBG_print("disabling station mode");
        WiFi.disconnect(true);
        station_mode_success = true;
    }

    if (flags.is_softap_enabled) {
        __LDBG_print("init AP mode");

        auto softAp = Network::SoftAP::getConfig();

